AhmedHassanien34/COTS_STM32F446RE/1- MCAL/3- STK/src/SysTick_program.c
/********************************************************************************************/
/********************************************************************************************/
/**************************		Author:  Ahmed Mohamed Mohamed Hassanien        *************/
/**************************		Date:    27 JULY 2023	            			*************/
/**************************		Layer:   MCAL								   	*************/
/**************************		SWC:	 SYSTICK								*************/
/**************************		Version: 1.00 	             					*************/
/********************************************************************************************/
/********************************************************************************************/

/********************************************************************************************/
/* Include libraries                                                                        */
/********************************************************************************************/
#include "stdint.h"

#include "Stm32F466xx.h"
#include "Utils.h"

/********************************************************************************************/
/* Include libraries                                                                        */
/********************************************************************************************/
#include "SysTick_config.h"
#include "SysTick_private.h"
#include "SysTick_interface.h"



STK_Callback_t Global_SysTickCallback;
Interval_t Global_Interval;

void SysTick_Handler(void)
{
	if (Global_Interval == Interval_Single)
	{
		//disable counter
		CLR_BIT(STK->STK_CTRL,ENABLE);
	}
	if (Global_SysTickCallback != 0)
	{
		Global_SysTickCallback();
	}
}

void STK_vInit()
{
	/*1. CLK SRC*/
	CLR_BIT(STK->STK_CTRL,CLKSOURCE); // AHB/8 = 2 MHz

	/*2. interrupt enable  */
	SET_BIT(STK->STK_CTRL,TICKINT); // Enable INT


}

void STK_vStartTimer(uint32_t copy_u32Ticks)
{
	// reset timer value to clear count flag
	STK->STK_VAL = 0 ;
	// load timer
	STK->STK_LOAD=copy_u32Ticks;
	//Enable timer
	SET_BIT(STK->STK_CTRL,ENABLE);
}
void STK_vStopTimer()
{
	// reset timer value to clear count flag
	STK->STK_VAL = 0 ;

	//disable counter
	CLR_BIT(STK->STK_CTRL,ENABLE);
}


void STK_vSetBusyWait(uint32_t copy_u32Ticks)
{
	// reset timer value to clear count flag
	STK->STK_VAL = 0 ;
	// load timer
	STK->STK_LOAD=copy_u32Ticks;
	//Enable timer
	SET_BIT(STK->STK_CTRL,ENABLE);
	//Busy wait
	while(GET_BIT(STK->STK_CTRL,COUNTFLAG) != 1);
	// stop timer
	SET_BIT(STK->STK_CTRL,ENABLE);

}
void STK_vSetIntervalSingle(uint32_t copy_u32Ticks,STK_Callback_t copy_pSTK_Callback)
{
	// callback
	Global_Interval=Interval_Single;
	Global_SysTickCallback=copy_pSTK_Callback;

	// reset timer value to clear count flag
	STK->STK_VAL = 0 ;

	// load timer
	STK->STK_LOAD=copy_u32Ticks;
	//Enable timer
	SET_BIT(STK->STK_CTRL,ENABLE);
}
void STK_vSetIntervalPeriodic(uint32_t copy_u32Ticks,STK_Callback_t copy_pSTK_Callback)
{

	// callback
	Global_Interval=Interval_Periodic;
	Global_SysTickCallback=copy_pSTK_Callback;

	// reset timer value to clear count flag
	STK->STK_VAL = 0 ;

	// load timer
	STK->STK_LOAD=copy_u32Ticks;
	//Enable timer
	SET_BIT(STK->STK_CTRL,ENABLE);

}

uint32_t STK_vGetElapsedTime()
{
	return ( STK->STK_LOAD - STK->STK_VAL) ;
}
uint32_t STK_vGetRemainingTime()
{
	return STK->STK_VAL ;
}
